[
    {
        "id": "1",
        "name": "Seiko Flight Master Chronograph Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Bi-directional rotating black PVD bezel. Black dial with luminous hands and dot hour markers. Minute markers. Tachymeter markings. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 seconds, 60 minutes and 12 hours (alarm). Quartz movement. Scratch resistant Hardlex crystal. Screw down crown. Solid case back. Case diameter: 42 mm. Case thickness: 13 mm. Round case shape. Push button deployment clasp. Water resistant at 200 meters / 660 feet. Functions: alarm, tachymeter, second, chronograph, date, hour, minute. Additional Info: alarm; fuel consumption calculations; flight climb calculations; chronograph; tachymeter; date displays at 3 o'clock position. Sport watch style. Watch label: Japan Movt. Item Variations: SNA411, SNA411-1, SNA411-P1, SNA411P1, Seiko-SNA411, Seiko-SNA411-1. Seiko Flight Chronograph Steel Black Dial Men's Watch SNA411.",
        "price": "229.99",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/s/e/seiko-flight-chronograph-steel-black-dial-mens-watch-sna411.jpg?width=546&height=546"
    },
    {
        "id": "2",
        "name": "Tissot PRS 516 Automatic Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Bi-directional rotating black PVD bezel. Black dial with luminous hands and dot hour markers. Minute markers. Tachymeter markings. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 seconds, 60 minutes and 12 hours (alarm). Quartz movement. Scratch resistant Hardlex crystal. Screw down crown. Solid case back. Case diameter: 42 mm. Case thickness: 13 mm. Round case shape. Push button deployment clasp. Water resistant at 200 meters / 660 feet. Functions: alarm, tachymeter, second, chronograph, date, hour, minute. Additional Info: alarm; fuel consumption calculations; flight climb calculations; chronograph; tachymeter; date displays at 3 o'clock position. Sport watch style. Watch label: Japan Movt. Item Variations: SNA411, SNA411-1, SNA411-P1, SNA411P1, Seiko-SNA411, Seiko-SNA411-1. Seiko Flight Chronograph Steel Black Dial Men's Watch SNA411.",
        "price": "334.99",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/t/i/tissot-prs-516-automatic-black-dial-men_s-watch-t100.430.11.051.00_1.jpg?width=546&height=546"
    },
    {
        "id": "3",
        "name": "Longines HydroConquest Automatic Watch",
        "description": "Description Stainless steel case with a stainless steel bracelet. Uni-directional rotating stainless steel bezel with a black ring. Black dial with luminous silver-tone hands and index hour markers. Arabic numerals mark the 6, 9 and 12 o'clock positions. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Longines calibre L619/888 automatic movement, based upon ETA 2892, containing 21 Jewels, bitting at 25200 vph, and has a power reserve of approximately 64 hours. Scratch resistant sapphire crystal. Screw down crown. Solid case back. Round case shape. Case size: 41 mm. Case thickness: 12 mm. Band width: 21 mm. Fold over clasp with a safety release. Water resistant at 300 meters / 1000 feet. Functions: date, hour, minute, second. Hydroconquest Series. Dive watch style. Watch label: Swiss Made. Longines HydroConquest 41mm Automatic Black Dial Men's Watch L3.742.4.56.6.",
        "price": "895.00",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/l/o/longines-hydroconquest-black-dial-automatic-men_s-watch-l3.742.4.56.6.jpg?width=546&height=546"
    },
    {
        "id": "4",
        "name": "Hamilton Khaki Chronograph Automatic",
        "description": "Stainless steel case with a brown leather strap. Fixed stainless steel bezel. Silver dial with blue spade-shaped hands and Arabic numeral hour markers. Minute markers. Arabic numeral minute markers (at 5 minute intervals) around the outer rim. Dial Type: Analog. Date display at the 3 o'clock position. Chronograph - two sub-dials displaying: 12 hour and 30 minute. Hamilton calibre H-21 Automatic movement, based upon ETA 7750, containing 25 Jewels, bitting at 28800 vph, and has a power reserve of approximately 60 hours. Scratch resistant sapphire crystal. Screw down crown. Transparent case back. Round case shape. Case size: 44 mm. Case thickness: 10 mm. Band width: 22 mm. Tang clasp. Water resistant at 100 meters / 330 feet. Functions: chronograph, date, hour, minute, second. Khaki Series. Dress watch style. Watch label: Swiss Made. Hamilton Khaki Navy Pioneer Chronograph Automatic Men's Watch H77706553.",
        "price": "1170.00",
        "premium": "false",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/h/a/hamilton-khaki-navy-pioneer-chronograph-automatic-mens-watch-h77706553.jpg?width=546&height=546"
    },
    {
        "id": "5",
        "name": "Longines Master Collection Moonphase Watch",
        "description": "Silver-tone stainless steel case with a dark brown alligator leather strap. Fixed silver-tone stainless steel bezel. Silver textured dial with blue leaf-style shape hands and black Arabic numerals hour markers. Date scale around the outer rim. Minute markers around the inner bezel. Dial Type: Analog. Luminescent hands and markers. Day of the week and month dispyed at the 12 o'clock position. Three sub-dials displaying: dual 24 hour/60 second, 30 minute and 12 hour/moon phase. Longines Calibre L678 Automatic movement, based upon Valjoux 7751, containing 25 Jewels, bitting at 28800 vph, and has a power reserve of approximately 48 hours. Scratch resistant sapphire crystal. Pull / push crown. Skeleton case back. Round case shape, case size: 40 mm, case thickness: 14 mm. Band width: 19 mm, band length: 8 inches. Tang clasp. Water resistant at 30 meters / 100 feet. Functions: chronograph, month, date, day, moonphase, hours, minutes, second, 24 hours. Master Collection Complete Calendar Series. Dress watch style. Watch label: Swiss Made. Item Variations: L2 673 4 78 3, L2-673-4-78-3, L2/673/4/78/3, L26734783. Longines Master Collection Moonphase Men's Watch L2.673.4.78.3.",
        "price": "2350.00",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/l/o/longines-master-collection-men_s-watch-l2.673.4.78.3_5.jpg?width=546&height=546"
    },
    {
        "id": "6",
        "name": "Tudor Black Bay Automatic GMT Pepsi Bezel Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Bi-directional rotating coin edge stainless steel bezel with a red and blue aluminium (Pepsi) top ring showing 24 hour markers. Black dial with luminous silver-tone snowflake hands and dot hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Tudor calibre MT5652 automatic movement, containing 26 Jewels, bitting at 28800 vph, and has a power reserve of approximately 70 hours. Scratch resistant sapphire crystal. Screw down crown. Solid case back. Round case shape. Case size: 41 mm. Band width: 22 mm. Fold over clasp. Water resistant at 200 meters / 660 feet. Functions: GMT, second time zone, hour, minute, second, date. Black Bay Series. Luxury watch style. Watch label: Swiss Made. Tudor Black Bay Automatic Black Dial Men's GMT Pepsi Bezel Watch 79830RB-0001.",
        "price": "3950.00",
        "premium": "false",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/s/e/seiko-flight-chronograph-steel-black-dial-mens-watch-sna411.jpg?width=546&height=546"
    },
    {
        "id": "7",
        "name": "Omega Speedmaster Chronograph Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Fixed stainless steel bezel with a black aluminium top ring showing tachymeter markings. Black dial with rhodium-plated hands and index hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Chronograph - three sub-dials displaying: 60 second, 30 minute and 12 hour. Omega calibre 3330 automatic movement, based upon ETA Valjoux 7753, containing 31 Jewels, bitting at 28800 vph, and has a power reserve of approximately 52 hours. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Round case shape, case size: 38 mm, case thickness: 13.2 mm. Band width: 18 mm. Fold over clasp with a push button release. Water resistant at 100 meters / 330 feet. Functions: chronograph, tachymeter, hour, minute, second. Speedmaster Series. Luxury watch style. Watch label: Swiss Made. Omega Speedmaster Chronograph Automatic Black Dial Men's Watch 324.30.38.50.01.001.",
        "price": "3995.00",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/o/m/omega-speedmaster-chronograph-automatic-black-dial-mens-watch-32430385001001-32430385001001.jpg?width=546&height=546"
    },
    {
        "id": "8",
        "name": "Rolex Datejust Black Dial 18k Gold Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Bi-directional rotating black PVD bezel. Black dial with luminous hands and dot hour markers. Minute markers. Tachymeter markings. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Chronograph - three sub-dials displaying: 60 seconds, 60 minutes and 12 hours (alarm). Quartz movement. Scratch resistant Hardlex crystal. Screw down crown. Solid case back. Case diameter: 42 mm. Case thickness: 13 mm. Round case shape. Push button deployment clasp. Water resistant at 200 meters / 660 feet. Functions: alarm, tachymeter, second, chronograph, date, hour, minute. Additional Info: alarm; fuel consumption calculations; flight climb calculations; chronograph; tachymeter; date displays at 3 o'clock position. Sport watch style. Watch label: Japan Movt. Item Variations: SNA411, SNA411-1, SNA411-P1, SNA411P1, Seiko-SNA411, Seiko-SNA411-1. Seiko Flight Chronograph Steel Black Dial Men's Watch SNA411.",
        "price": "15,750.00",
        "premium": "true",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/r/o/rolex-datejust-36-black-diamond-dial-mens-stainless-steel-and-18kt-yellow-gold-jubilee-watch-126233bkdj--.jpg?width=546&height=546"
    },
    {
        "id": "9",
        "name": "Raymond Weil Maestro Automatic Watch",
        "description": "Stainless steel case with a black leather strap. Fixed stainless steel bezel. Silver white dial with blue Breguet-style shape hands and Roman numeral hour markers. Minute markers around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Raymond Weil calibre RW 4530 automatic movement, containing 26 Jewels, bitting at 28800 vph, and has a power reserve of approximately 38 hours. Scratch resistant sapphire crystal. Pull / push crown. Skeleton case back. Round case shape. Case size: 39.5 mm. Case thickness: 9.5 mm. Band width: 20 mm. Band length: 7.75 inches. Tang clasp. Water resistant at 50 meters / 165 feet. Functions: date, hour, minute, second. Maestro Series. Dress watch style. Watch label: Swiss Made. Item Variations: 2837 STC 00659, 2837.STC.00659, 2837STC00659. Raymond Weil Maestro Automatic Silver Dial Men's Watch 2837-STC-00659.",
        "price": "489.00",
        "premium": "false",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/r/a/raymond-weil-maestro-silver-dial-black-leather-mens-watch-2837stc00659.jpg?width=546&height=546"
    },
    {
        "id": "10",
        "name": "Citizen Eco Drive Blue Angel Chronograph Watch",
        "description": "Stainless steel case with a stainless steel bracelet. Fixed blue ion-plated bezel. Blue dial with luminous hands and index hour markers. Minute markers. World time cities. Navigation calculator markings around the outer rim. Dial Type: Analog. Luminescent hands and markers. Date display at the 3 o'clock position. Three sub-dials displaying: 60 second, 24 hour and dual 1/100th of a second/day of the week. Eco-Drive H800 Atomic Timekeeping Radio Controlled eco-drive movement. Scratch resistant sapphire crystal. Pull / push crown. Solid case back. Round case shape. Case size: 43 mm. Case thickness: 12 mm. Band width: 22 mm. Band length: 8.5 inches. Fold over clasp with a double push button release. Water resistant at 200 meters / 660 feet. Functions: chronograph, date, hour, minute, second, perpetual calendar, world time. Blue Angels Series. Sport watch style. Watch label: Japan Movt. Item Variations: AT8020 54L, AT8020.54L, AT802054L. Citizen Eco Drive Blue Angels Chronograph Men's Watch AT8020-54L.",
        "price": "399.99",
        "premium": "false",
        "image": "https://cdn2.jomashop.com/media/catalog/product/cache/fde19e4197824625333be074956e7640/c/i/citizen-eco-drive-blue-angels-chronograph-mens-watch-at802054l.jpg?width=546&height=546"
    }
]